code/openfoam/tutorials/incompressibleVoF/DTCHullMoving/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Copy DTC hull surface from resources folder
cp $FOAM_TUTORIALS/resources/geometry/DTC-scaled.stl.gz constant/geometry/

# Extract features
runApplication surfaceFeatures

# Mesh in parallel
runApplication blockMesh
runApplication decomposePar -noFields
runParallel refineMesh
runParallel snappyHexMesh

# Renumber
runParallel renumberMesh -noFields

#------------------------------------------------------------------------------
